电脑/python/官方内置模块/基本内置模块熟悉.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-06-23 四 13:33 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>基本内置模块熟悉</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">基本内置模块熟悉</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. pickle模块</a>
<ul>
<li><a href="#orgheadline1">1.1. 将对象存入文件</a></li>
<li><a href="#orgheadline2">1.2. 从文件中取出对象</a></li>
</ul>
</li>
<li><a href="#orgheadline6">2. shelve模块</a>
<ul>
<li><a href="#orgheadline4">2.1. 存入多个对象</a></li>
<li><a href="#orgheadline5">2.2. 读取这些对象</a></li>
</ul>
</li>
<li><a href="#orgheadline15">3. sys模块</a>
<ul>
<li><a href="#orgheadline7">3.1. sys.argv</a></li>
<li><a href="#orgheadline8">3.2. exit函数</a></li>
<li><a href="#orgheadline9">3.3. sys.platform</a></li>
<li><a href="#orgheadline10">3.4. sys.path</a></li>
<li><a href="#orgheadline11">3.5. 标准输入输出错误输出文件</a></li>
<li><a href="#orgheadline12">3.6. sys.version</a></li>
<li><a href="#orgheadline13">3.7. sys.maxsize</a></li>
<li><a href="#orgheadline14">3.8. sys.stdin.isatty()</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<div class="outline-2">
<h2 id="orgheadline3">pickle模块</h2>
<div class="outline-text-2" id="text-1">
<p>
pickle模块可以将某一个复杂的对象永久存入一个文件中，以后再导入这个文件，这样自动将这个复杂的对象导入进来了。
</p>
</div>

<div class="outline-3">
<h3 id="orgheadline1">将对象存入文件</h3>
<div class="outline-text-3" id="text-1-1">
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">pickle</span>

<span class="k">class</span> <span class="nc">Test</span><span class="p">:</span>
    <span class="k">def</span> <span class="nf">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">a</span><span class="o">=</span><span class="mi">0</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">b</span><span class="o">=</span><span class="mi">0</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">c</span><span class="o">=</span><span class="mi">1</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">d</span><span class="o">=</span><span class="mi">1</span>

    <span class="k">def</span> <span class="nf">__str__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="k">return</span> <span class="nb">str</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">__dict__</span><span class="p">)</span>

<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s1">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">test001</span><span class="o">=</span><span class="n">Test</span><span class="p">()</span>
    <span class="k">print</span><span class="p">(</span><span class="n">test001</span><span class="p">)</span>
    <span class="n">testfile</span><span class="o">=</span><span class="nb">open</span><span class="p">(</span><span class="s1">&#39;data.pkl&#39;</span><span class="p">,</span><span class="s1">&#39;wb&#39;</span><span class="p">)</span>
    <span class="n">pickle</span><span class="o">.</span><span class="n">dump</span><span class="p">(</span><span class="n">test001</span><span class="p">,</span><span class="n">testfile</span><span class="p">)</span>
    <span class="n">testfile</span><span class="o">.</span><span class="n">close</span><span class="p">()</span>
</pre></div>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline2">从文件中取出对象</h3>
<div class="outline-text-3" id="text-1-2">
<p>
值得一提的是从文件中取出对象，原来的类的定义还是必须存在，也就是声明一次在内存中的，否则会出错。
</p>
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">pickle</span>

<span class="k">class</span> <span class="nc">Test</span><span class="p">:</span>
    <span class="k">def</span> <span class="nf">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">a</span><span class="o">=</span><span class="mi">0</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">b</span><span class="o">=</span><span class="mi">0</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">c</span><span class="o">=</span><span class="mi">1</span>
        <span class="bp">self</span><span class="o">.</span><span class="n">d</span><span class="o">=</span><span class="mi">1</span>

    <span class="k">def</span> <span class="nf">__str__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
        <span class="k">return</span> <span class="nb">str</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">__dict__</span><span class="p">)</span>

<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s1">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">testfile</span><span class="o">=</span><span class="nb">open</span><span class="p">(</span><span class="s1">&#39;data.pkl&#39;</span><span class="p">,</span><span class="s1">&#39;rb&#39;</span><span class="p">)</span>
    <span class="n">test001</span><span class="o">=</span><span class="n">pickle</span><span class="o">.</span><span class="n">load</span><span class="p">(</span><span class="n">testfile</span><span class="p">)</span>
    <span class="k">print</span><span class="p">(</span><span class="n">test001</span><span class="p">)</span>
    <span class="n">testfile</span><span class="o">.</span><span class="n">close</span><span class="p">()</span>
</pre></div>

<p>
pickle模块的基本使用就是用dump函数将某个对象存入某个文件中，然后这个文件以后可以用load函数来加载，然后之前的那个对象会自动返回出来。
</p>
</div>
</div>
</div>



<div class="outline-2">
<h2 id="orgheadline6">shelve模块</h2>
<div class="outline-text-2" id="text-2">
<p>
shelve模块是基于pickle模块的，也就是只有pickle模块支持的对象它才支持。 之前提及pickle模块只能针对一个对象，如果你有多个对象要处理，可以考虑使用shelve模块，而shelve模块就好像是自动将这些对象用字典的形式包装起来了。除此之外shelve模块的使用更加简便了。
</p>
</div>

<div class="outline-3">
<h3 id="orgheadline4">存入多个对象</h3>
<div class="outline-text-3" id="text-2-1">
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">shelve</span>
<span class="kn">from</span> <span class="nn">Hero</span> <span class="kn">import</span> <span class="n">Garen</span>

<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s1">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">garen1</span><span class="o">=</span><span class="n">Garen</span><span class="p">()</span>
    <span class="n">garen2</span><span class="o">=</span><span class="n">Garen</span><span class="p">(</span><span class="s1">&#39;red&#39;</span><span class="p">)</span>
    <span class="n">garen3</span><span class="o">=</span><span class="n">Garen</span><span class="p">(</span><span class="s1">&#39;yellow&#39;</span><span class="p">)</span>
    <span class="n">db</span><span class="o">=</span><span class="n">shelve</span><span class="o">.</span><span class="n">open</span><span class="p">(</span><span class="s1">&#39;test.db&#39;</span><span class="p">)</span>
    <span class="k">for</span> <span class="p">(</span><span class="n">key</span><span class="p">,</span><span class="n">item</span><span class="p">)</span> <span class="ow">in</span> <span class="p">[(</span><span class="s1">&#39;garen1&#39;</span><span class="p">,</span><span class="n">garen1</span><span class="p">),(</span><span class="s1">&#39;garen2&#39;</span><span class="p">,</span><span class="n">garen2</span><span class="p">),(</span><span class="s1">&#39;garen3&#39;</span><span class="p">,</span><span class="n">garen3</span><span class="p">)]:</span>
        <span class="n">db</span><span class="p">[</span><span class="n">key</span><span class="p">]</span><span class="o">=</span><span class="n">item</span>
    <span class="n">db</span><span class="o">.</span><span class="n">close</span><span class="p">()</span>
</pre></div>


<p>
我们看到整个过程的代码变得非常的简洁了，然后一个个对象是以字典的形式存入进去的。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline5">读取这些对象</h3>
<div class="outline-text-3" id="text-2-2">
<p>
读取这些对象的代码也很简洁，就是用shelve模块的open函数打开数据库文件，open函数会自动返回一个字典对象，这个字典对象里面的数据就对应着之前存入的键值和对象。
</p>

<p>
同时通过这个例子我发现，如果自己定义的类，将他们提取出来放入另外一个文件，那么shelve模块读取文件时候是不需要再引入之前的定义。这一点值得我们注意，因为shelve模块内部也采用的是pickle的机制，所以可以猜测之前pickle的那个例子类的定义写在写入文件代码的里面，所以不能载入数据库；而如果将这些类的定义放入一个文件，然后这些类以模块或说模块载入的形式引入，那么读取这些对象就可以以一种更优雅的形式实现。如下所示：
</p>
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">shelve</span>

<span class="k">if</span> <span class="n">__name__</span> <span class="o">==</span> <span class="s1">&#39;__main__&#39;</span><span class="p">:</span>
    <span class="n">db</span><span class="o">=</span><span class="n">shelve</span><span class="o">.</span><span class="n">open</span><span class="p">(</span><span class="s1">&#39;test.db&#39;</span><span class="p">)</span>
    <span class="k">for</span> <span class="n">key</span> <span class="ow">in</span> <span class="nb">sorted</span><span class="p">(</span><span class="n">db</span><span class="p">):</span>
        <span class="k">print</span><span class="p">(</span><span class="n">db</span><span class="p">[</span><span class="n">key</span><span class="p">])</span>
    <span class="n">db</span><span class="o">.</span><span class="n">close</span><span class="p">()</span>
</pre></div>

<p>
我们看到就作为简单的程序或者原型程序的数据库，shelve模块已经很好用而且够用了。
</p>
</div>
</div>
</div>


<div class="outline-2">
<h2 id="orgheadline15">sys模块</h2>
<div class="outline-text-2" id="text-3">
<p>
sys模块有一些功能很常用，其实在前面我们就看到过一些了。
</p>
</div>

<div class="outline-3">
<h3 id="orgheadline7">sys.argv</h3>
<div class="outline-text-3" id="text-3-1">
<p>
在刚开始说明python执行脚本参数传递的问题时就已经讲了sys.argv这个变量。这是一个由字符串组成的列表。
</p>
<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">sys</span>
<span class="k">print</span><span class="p">(</span><span class="n">sys</span><span class="o">.</span><span class="n">argv</span><span class="p">)</span>
<span class="k">for</span> <span class="n">i</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="nb">len</span><span class="p">(</span><span class="n">sys</span><span class="o">.</span><span class="n">argv</span><span class="p">)):</span>
    <span class="k">print</span><span class="p">(</span><span class="n">sys</span><span class="o">.</span><span class="n">argv</span><span class="p">[</span><span class="n">i</span><span class="p">])</span>
</pre></div>


<p>
比如新建上面的一个test.py文件，然后执行：
</p>
<pre>
python3 test.py test1 test2
['test.py', 'test1', 'test2']
test.py
test1
test2
</pre>


<p>
我们可以看到 <code>sys.argv[0]</code> 就是这个脚本的文件名，然后后面依次是各个参数。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline8">exit函数</h3>
<div class="outline-text-3" id="text-3-2">
<p>
这个我们在编写GUI程序的时候经常看到，在其他脚本程序中也很常用。如果不带参数的话那么直接退出程序，还可以带一个字符串参数，返回错误提示信息，或者带一个数字，这里的详细讨论略过。
</p>

<div class="highlight"><pre><span></span>&gt;&gt;&gt; import sys
&gt;&gt;&gt; sys.exit<span class="o">(</span><span class="s1">&#39;出错了&#39;</span><span class="o">)</span>
出错了
</pre></div>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline9">sys.platform</h3>
<div class="outline-text-3" id="text-3-3">
<p>
返回当前脚本执行的操作系统环境。
</p>

<p>
Linux 返回字符串值：linux；Windows返回win32；Mac OS X 返回darwin。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline10">sys.path</h3>
<div class="outline-text-3" id="text-3-4">
<p>
一连串字符串列表，是python脚本模块的搜索路径，所以我们自定义的python模块，只需要在sys.path这个列表上新加一个字符串路径即可。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline11">标准输入输出错误输出文件</h3>
<div class="outline-text-3" id="text-3-5">
<p>
sys.stdin，sys.stdout，sys.stderr这三个文件对象对应的就是linux系统所谓的标准输入标准输出和错误输出文件流对象。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline12">sys.version</h3>
<div class="outline-text-3" id="text-3-6">
<p>
sys.version输出当前python的版本信息和编译环境的详细信息。
</p>

<p>
<code>sys.version_info[0]</code> 返回当前python主版本的标识，比如python3就返回数字3。
</p>
</div>
</div>

<div class="outline-3">
<h3 id="orgheadline13">sys.maxsize</h3>
<div class="outline-text-3" id="text-3-7">
<p>
返回当前计算环境下整数(int)类型的最大值，32位系统是 \(2**31-1\) 。
</p>
<pre>
&gt;&gt;&gt; 2**31-1
2147483647
&gt;&gt;&gt; import sys
&gt;&gt;&gt; sys.maxsize
2147483647
</pre>
</div>
</div>


<div class="outline-3">
<h3 id="orgheadline14">sys.stdin.isatty()</h3>
<div class="outline-text-3" id="text-3-8">
<p>
测试输入流是不是终端。如果是终端，则返回True。
</p>


<div class="NOTECARD">
<p>
更多内容请参见 <a href="https://docs.python.org/3/library/sys.html">官方文档</a> 。
</p>

</div>
</div>
</div>
</div>
</div>
</body>
</html>
